#+TITLE: 推导式
#+DATE: 2024-05-02 20:40:42
#+DISPLAY: t
#+STARTUP: indent
#+OPTIONS: toc:10
#+AUTHOR: inmove
#+SUBTITLE: 列表推导式 字典推导式 元组推导式 集合推导式 海象表达式
#+KEYWORDS: ListExpression DictExpression WalrusExpression TupleExpression
#+CATEGORIES: Python

* 列表表达式
#+begin_src python :results output
  squares = [x ** 2 for x in range(10)]
  print(squares, type(squares))
#+end_src

#+RESULTS:
: [0, 1, 4, 9, 16, 25, 36, 49, 64, 81] <class 'list'>

* 元组表达式
#+begin_src python :results output
  squares_tuple = (x ** 2 for x in range(10))
  print(squares_tuple, type(squares_tuple))
#+end_src

#+RESULTS:
: <generator object <genexpr> at 0x7fe9cecd35e0> <class 'generator'>

* 字典表达式
#+begin_src python :results output
  square_dict = {x: x ** 2 for x in range(10)}
  print(square_dict, type(square_dict))
#+end_src

#+RESULTS:
: {0: 0, 1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81} <class 'dict'>

* 集合表达式
#+begin_src python :results output
  square_set = {x for x in range(10)}
  print(square_set, type(square_set))

#+end_src

#+RESULTS:
: {0, 1, 2, 3, 4, 5, 6, 7, 8, 9} <class 'set'>

* 海象表达式(:=)
Python >= 3.8
#+begin_src python :results output
  arr = [1, 2, 3]
  if (n := len(arr)) >= 3:
      print(f"length of arr is {n}")
#+end_src

#+RESULTS:
: length of arr is 3
